{
    "type": "error",
    "data": "Error Invoking LLM",
    "stack": "Traceback (most recent call last):\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\base_llm.py\", line 54, in _invoke\n    output = await self._execute_llm(input, **kwargs)\n             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\openai\\openai_embeddings_llm.py\", line 36, in _execute_llm\n    embedding = await self.client.embeddings.create(\n                ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\resources\\embeddings.py\", line 236, in create\n    return await self._post(\n           ^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\_base_client.py\", line 1843, in post\n    return await self.request(cast_to, opts, stream=stream, stream_cls=stream_cls)\n           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\_base_client.py\", line 1537, in request\n    return await self._request(\n           ^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\_base_client.py\", line 1638, in _request\n    raise self._make_status_error_from_response(err.response) from None\nopenai.BadRequestError: Error code: 400 - {'error': {'code': '1210', 'message': 'API 调用参数有误，请检查文档。'}}\n",
    "source": "Error code: 400 - {'error': {'code': '1210', 'message': 'API 调用参数有误，请检查文档。'}}",
    "details": {
        "input": [
            "# Fezziwig's Christmas Eve Celebration Community\n\nThis community is centered around Fezziwig's Christmas Eve party, an event that brings together various entities including Fezziwig himself, his family, employees, and attendees. The relationships between these entities highlight the significance of the event and the joyous atmosphere it creates.\n\n## Fezziwig as the community's central figure\n\nFezziwig is the central figure in this community, recognized for his love of dancing and his role in hosting the Christmas Eve party. His character is described as jolly and esteemed, which has a significant impact on the atmosphere of the event. [Data: Entities (80), Relationships (142, 143, 140, 141)]\n\n## The Christmas Eve party as a focal point\n\nThe Christmas Eve party is the pivotal event in this community, serving as the setting where all other entities interact. It is described as a memorable event filled with dancing and joy, suggesting a strong communal bond. [Data: Entities (90), Relationships (142, 152, 148, 151, 149, 150)]\n\n## Dancing as a significant activity\n\nDancing is a significant activity that took place during Fezziwig's Christmas Eve party, facilitated by the fiddler's music. This traditional form of celebration underscores the community's connection to old customs and the importance of shared experiences. [Data: Entities (97), Relationships (152, 147)]\n\n## Fezziwig's impact on his apprentices\n\nFezziwig's interaction with his apprentices highlights his positive influence on them. The apprentices express deep gratitude and admiration for Fezziwig, indicating that he is respected and appreciated for his guidance and the effect he has on those around him. [Data: Relationships (143)]\n\n## Family bonds within the community\n\nThe close relationship between Fezziwig and his family, including his wife and daughters, is evident in their joint participation in the Christmas Eve party. Their interactions during the event showcase a strong family bond and a shared sense of joy in the celebration. [Data: Relationships (140, 141)]\n\n## The role of music in the celebration\n\nThe fiddler's role in providing music for the dances at the party is integral to the celebration. The music not only facilitates the dancing but also contributes to the overall festive atmosphere, emphasizing the communal nature of the event. [Data: Entities (89), Relationships (146, 147)]\n\n## Community participation in the event\n\nThe Christmas Eve party is characterized by the participation of a diverse group of attendees, including Fezziwig's family, employees, and friends. This wide range of participants suggests a strong sense of community and the importance of the event in bringing people together. [Data: Relationships (148)]\n\n## The significance of dance couples\n\nThe presence of specific dance couples, such as the old top couple, new top couple, and the bottom couple, adds structure to the event's dancing. These couples may represent different generations or statuses within the community, highlighting the event's traditional and hierarchical aspects. [Data: Relationships (149, 150, 151)]",
            "# Scrooge and Christmas Carol Community\n\nThe community is centered around Scrooge's interactions with a Christmas carol and a discussion with a gentleman concerning the poor and the Christmas season. The entities involved are interconnected through the themes of the Christmas season and social responsibility.\n\n## Scrooge's reaction to the Christmas carol\n\nScrooge's reaction to the Christmas carol sung by the young nose owner is a central aspect of this community. His response could indicate his attitude towards the festive season and his willingness to engage with the community's expectations. This interaction is significant as it sets the stage for Scrooge's character development and potential change in perspective. [Data: Relationships (55)]\n\n## The gentleman's conversation with Scrooge\n\nThe gentleman's conversation with Scrooge about the poor and the upcoming Christmas season is a key event in this community. It highlights the societal expectations of charity and compassion during the festive season. This interaction is crucial in understanding the social dynamics and the moral lessons associated with Scrooge's character. [Data: Relationships (50)]\n\n## Association of the poor and destitute with the Christmas carol\n\nThe poor and destitute are associated with the Christmas carol being sung, suggesting a connection between the themes of the carol and the plight of the less fortunate. This linkage underscores the carol's role in bringing attention to social issues and the need for charitable actions, especially during the Christmas season. [Data: Relationships (121)]\n\n## The gentleman advocating for the poor and destitute\n\nThe gentleman's advocacy for the poor and destitute is an essential element within this community, reflecting the social consciousness of the time. His actions and words could inspire others to consider their responsibilities towards those in need, potentially leading to societal changes or shifts in public opinion. [Data: Relationships (120)]\n\n## The Christmas carol as a symbol of the season's spirit\n\nThe Christmas carol itself is a symbol of the season's spirit and joy, which contrasts with the depiction of the poor and destitute. This duality represents the community's complex view of the Christmas season, encompassing both celebration and the awareness of social issues. [Data: Entities (38)]",
            "# Cratchit Family Christmas Celebration\n\nThe community is centered around the Cratchit family's celebration of Christmas Day, which includes a significant dinner gathering. The entities involved are Christmas Day, the Cratchit Family, and the Christmas Dinner, with relationships highlighting the importance of the holiday to the family and their activities on this day.\n\n## Christmas Day as a pivotal event\n\nChristmas Day is a pivotal event in the story, symbolizing the spirit of the holiday and playing a key role in Scrooge's transformation. It is celebrated by the Cratchit family, which underscores the significance of this day in their lives. [Data: Entities (120), Relationships (102, 167)]\n\n## Cratchit Family as the core entity\n\nThe Cratchit Family is the core entity of this community, representing the family unit that celebrates Christmas Day together. Their celebration is an embodiment of the holiday's spirit and is central to the story's themes of unity and joy. [Data: Entities (122), Relationships (167, 168)]\n\n## Christmas Dinner as a central celebration\n\nThe Christmas Dinner is a central event in the Cratchit family's celebration of Christmas Day. It is an occasion where the family comes together to feast, which is an important tradition in many cultures and symbolizes the warmth and togetherness of family bonds. [Data: Entities (129), Relationships (168)]\n\n## Scrooge's transformation linked to Christmas Day\n\nScrooge's transformation, which is a central theme of the story, is closely linked to Christmas Day. His acts of kindness and change of heart occur on this day, illustrating the holiday's potential to inspire personal growth and redemption. [Data: Relationships (102)]\n\n## The importance of family bonds\n\nThe relationships between the Cratchit family members and their celebration of Christmas Day underscore the importance of family bonds. The story emphasizes the significance of these bonds and their role in creating a supportive and loving environment, especially during festive occasions. [Data: Entities (122), Relationships (167)]",
            "# Scrooge's Past and the Golden Idol\n\nThe community is centered around Scrooge's past, particularly his younger self and the golden idol, which symbolizes his pursuit of wealth. The relationships between Scrooge, the golden idol, and the fair young girl reveal the impact of Scrooge's avarice on his personal relationships and character transformation.\n\n## Scrooge's connection to the golden idol\n\nScrooge's pursuit of the golden idol represents his avarice and the transformation in his character. This relationship indicates the central theme of wealth pursuit in Scrooge's life, which has led to a loss of personal relationships. [Data: Entities (100), Relationships (85)]\n\n## Link between Scrooge's former self and the golden idol\n\nThe golden idol is not only connected to Scrooge's present self but also to his former self, suggesting that the pursuit of wealth has been a long-standing trait. This connection highlights the continuity of Scrooge's values and the impact they have had on his life. [Data: Relationships (85, 154)]\n\n## The fair young girl as a victim of Scrooge's wealth pursuit\n\nThe fair young girl, who was once in a relationship with Scrooge's former self, has been displaced by the golden idol. This displacement signifies the destructive impact of wealth pursuit on personal relationships and emotional connections. [Data: Entities (99), Relationships (153, 154)]\n\n## Scrooge's former self as a reflection of his past\n\nScrooge's connection to his former self, facilitated by the Ghost of Christmas Past, is a crucial element in understanding his character development. This relationship serves as a reminder of the innocence and potential that Scrooge once had before his transformation into avarice. [Data: Entities (101), Relationships (84)]\n\n## The golden idol as a symbol of societal values\n\nThe golden idol's presence in Scrooge's past and its impact on his life suggest that it symbolizes more than just personal wealth. It represents the societal values that prioritize material wealth over personal connections and emotional well-being. [Data: Entities (100), Relationships (85, 154)]",
            "# The Scrooge Network: Interactions with Old Joe and Associates\n\nThis community is centered around the character Scrooge and his interactions with Old Joe and other individuals involved in various transactions and acquaintances. The entities within this community are connected through their relationships and activities, primarily dealing with stolen goods and other transactions.\n\n## Old Joe as a central figure in非法 transactions\n\nOld Joe is a pivotal character in this community, known for dealing in stolen goods and interacting with various individuals such as Scrooge, Mrs. Dilber, the laundress, and the undertaker's man. His transactions and relationships suggest a network of illegal activities. [Data: Entities (171), Relationships (98, 189, 188, 190)]\n\n## Scrooge's encounter with the criminal network\n\nScrooge, accompanied by the Phantom, encounters Old Joe and witnesses the appraisal of stolen items. This encounter indicates Scrooge's indirect involvement with the criminal activities within this community. [Data: Relationships (98)]\n\n## Mrs. Dilber's role in the stolen goods transactions\n\nMrs. Dilber regularly brings items to Old Joe for appraisal and sale, suggesting her role in the transactions of stolen goods. Her interactions with Old Joe and other characters indicate a network of individuals involved in these activities. [Data: Entities (172), Relationships (188, 191, 192)]\n\n## The laundress and her connections within the community\n\nThe laundress is familiar with Old Joe and has connections with Mrs. Dilber and the undertaker's man. This suggests her possible involvement in the same circle of transactions and illegal activities. [Data: Entities (173), Relationships (189, 193, 191)]\n\n## The undertaker's man and his relationships\n\nThe undertaker's man recognizes Old Joe and has interactions with both the laundress and Mrs. Dilber. His connections within this community hint at a broader network of individuals possibly involved in related activities. [Data: Entities (174), Relationships (190, 193, 192)]\n\n## Nature of transactions and potential criminal activities\n\nThe transactions and relationships among these characters suggest a network potentially involved in criminal activities, such as the trade of stolen goods. The interactions and familiarity among these individuals point to a structured operation. [Data: Relationships (98, 189, 188, 190, 193, 191, 192)]",
            "# Maritime Christmas Community\n\nThis community is centered around a ship (SHIP) and its crew during a Christmas period, with a focus on the roles of the look-out (LOOK-OUT), officers (OFFICERS), and ship's helmsman (SHIP'S HELMSMAN), as observed through Scrooge's vision in the presence of the Ghost.\n\n## SHIP as the central entity of the community\n\nSHIP is the central entity in this maritime community, acting as the base where all other roles and activities are situated. The ship's festive mood indicates a possible celebration, which is a unique aspect of this community. [Data: Entities (146), Relationships (91, 181, 182, 180)]\n\n## LOOK-OUT's position and responsibility\n\nThe LOOK-OUT is an essential role on the ship, positioned at the bow to watch for any potential obstacles or dangers. This role is critical for the safety of the ship and its crew. [Data: Entities (153), Relationships (181)]\n\n## OFFICERS managing the watch on the ship\n\nOFFICERS are crew members who have the responsibility of managing the watch on the ship. Their role is crucial for the ship's operation and the crew's well-being during the watch. [Data: Entities (154), Relationships (182)]\n\n## SHIP'S HELMSMAN steering the ship\n\nSHIP'S HELMSMAN is the person responsible for steering the ship as observed in the Ghost's vision. This role is vital for navigating the ship safely through the waters. [Data: Entities (152), Relationships (180)]\n\n## Scrooge's vision and the ship's festive spirit\n\nScrooge's vision of the ship and its crew in a Christmas mood suggests a contrast to his own experience. This observation is significant as it sets the context for the maritime community's atmosphere and the period's festivities. [Data: Relationships (91)]",
            "# Scrooge and Marley Business Community\n\nThe community is centered around the business partnership of Scrooge and Marley, involving the spectral presence of the deceased Marley, the ongoing operations of their firm, and its interactions with external entities such as charity collectors and the warehouse that displays their sign.\n\n## Continuation of Scrooge and Marley partnership posthumously\n\nThe business partnership of Scrooge and Marley continues to operate under the same name even after Marley's death. This indicates the legacy and brand value associated with the partnership, which may have enduring implications on the business community. [Data: Entities (15, 14, 39); Relationships (41, 42)]\n\n## Marley's spectral connection to Scrooge\n\nMarley's ghostly appearance to Scrooge signifies a profound supernatural connection between the two. This haunting encounter is central to the narrative and underscores the past business relationship and the unresolved issues that Scrooge must confront. [Data: Entities (14); Relationships (40)]\n\n## The warehouse as a physical representation of the firm\n\nThe warehouse where the Scrooge and Marley sign is displayed serves as a tangible symbol of the firm's presence and operations. This location may play a role in the business's ongoing activities and legacy. [Data: Entities (16); Relationships (42)]\n\n## Charity collectors' visit to Scrooge's office\n\nThe visit of the two portly gentlemen to Scrooge's office in relation to the firm's activities suggests the firm's engagement with charitable endeavors or the community's perception of the firm's social responsibility. [Data: Entities (30); Relationships (43)]\n\n## The spectral visitation as a catalyst for change\n\nMarley's ghostly visitation to Scrooge can be interpreted as a catalyst for Scrooge's moral and personal transformation. This supernatural event is a pivotal moment in the story and may symbolize the potential for significant change within the community or in Scrooge's character. [Data: Entities (14); Relationships (40)]\n\n## The business partnership's historical significance\n\nThe historical significance of the Scrooge and Marley partnership is underlined by the continued use of the name and the spectral visitation. This legacy may influence the business practices and reputation of the firm within the community. [Data: Entities (15, 39); Relationships (41)]",
            "# Scrooge Family Dynamics\n\nThe community is centered around the family dynamics involving Master Scrooge and his younger sister. The relationships suggest a temporal and familial connection, with significant implications for understanding the background and development of the character Master Scrooge.\n\n## Master Scrooge as a younger version of Scrooge\n\nThe entity 'Master Scrooge' represents a younger version of the character Scrooge, as evidenced by the description and the temporal relationship with the 'Scrooge' entity. This suggests a look into the past of the character, providing insight into his earlier life and development. [Data: Entities (75), Relationships (76)]\n\n## Sister's role in Master Scrooge's life\n\nThe 'Sister' entity is introduced as the younger sister of Master Scrooge, coming to bring him home for the holidays. This indicates a close familial bond and suggests a significant influence on Master Scrooge's life during his younger years. [Data: Entities (76), Relationships (139)]\n\n## Temporal relationship between Master Scrooge and Scrooge\n\nThe relationship between 'Master Scrooge' and 'Scrooge' signifies a temporal connection, suggesting that the story of Master Scrooge is a prequel to the story of Scrooge. This is important for understanding the character's evolution and the context of his future actions. [Data: Relationships (76)]\n\n## Familial bond as a key theme\n\nThe familial bond between Master Scrooge and his sister is a central theme in this community of entities. It underscores the importance of family in shaping the character's values and experiences. [Data: Relationships (139)]\n\n## Significance of the holiday context\n\nThe mention of the holidays in the relationship description indicates that the setting is significant for the narrative. It may provide a backdrop for key moments of character development and interaction. [Data: Relationships (139)]",
            "# The Cratchit Family and Scrooge's Benevolence\n\nThe community is centered around the Cratchit family, with key relationships to Ebenezer Scrooge and the events of Christmas. The entities' interactions and Scrooge's transformation play a significant role in the dynamics of this community, highlighting themes of empathy and social concern.\n\n## Bob Cratchit as the central figure of the Cratchit family\n\nBob Cratchit is the head of the Cratchit family, known for his cheerful demeanor and dedication to his job and family. His relationship with Scrooge, his employer, is central to the story, as it demonstrates the contrast between their economic statuses and the potential for kindness in the workplace. Bob's role as a father to Tiny Tim and his interactions with his other children and wife Mrs. Cratchit underscore the family's close-knit dynamics. [Data: Entities (5), Relationships (8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19)]\n\n## Tiny Tim's condition and its impact on the family\n\nTiny Tim, the sickly son of Bob Cratchit, is a focal point of the family's concerns and is significant to the community's narrative. His condition, noted as a cripple, is a symbol of the challenges the Cratchit family faces. Despite his illness, Tiny Tim's positive outlook and the family's care for him reflect the community's resilience and hope. [Data: Entities (118), Relationships (165, 166, 128)]\n\n## Scrooge's transformation and its effects on the Cratchit family\n\nScrooge's transformation from a harsh employer to a benevolent figure is pivotal to the community's dynamics. His gift of a turkey to the Cratchit family and his subsequent concern for Tiny Tim indicate a significant shift in his character. This change has a direct impact on the Cratchit family, improving their circumstances and highlighting the potential for personal growth to influence community well-being. [Data: Relationships (9, 88)]\n\n## The Cratchit family's Christmas celebration as a symbol of unity\n\nThe Cratchit family's Christmas celebration is a symbol of unity and joy despite their modest means. The family's preparation for the meal and their togetherness during the celebration are indicative of their strong bonds. This event is significant within the community as it showcases the importance of family and community support. [Data: Relationships (10, 12, 13, 14, 15, 16, 17, 18, 19)]\n\n## The role of Scrooge's nephew in offering support\n\nScrooge's nephew plays a role in the community by showing concern for Bob Cratchit and offering his help. This act of compassion suggests a sense of community and the willingness of individuals to support each other, contributing to the overall well-being of the community. [Data: Relationships (18)]\n\n## The social interactions of the Cratchit children\n\nThe interactions of the Cratchit children, including Martha, Belinda, Peter, and Master Peter, reflect the family's dynamics and their integration into the community. Their assistance in meal preparation and their relationships with their parents and each other provide insight into the family's structure and the roles each member plays. [Data: Relationships (17, 12, 13, 14, 16)]",
            "# Bob Cratchit's Christmas Celebration\n\nThe community is centered around Bob Cratchit's dwelling and the Christmas Present entity, highlighting a spiritual connection and the location of a significant Christmas celebration. The entities and their relationships reflect the importance of the event and the atmosphere of the celebration.\n\n## Bob Cratchit's dwelling as the heart of the celebration\n\nBob Cratchit's dwelling is the physical location where the Christmas celebration takes place, indicating its central role in the community. The dwelling is blessed by Christmas Present, which signifies its importance in the narrative and the celebration. [Data: Entities (123), Relationships (15, 169)]\n\n## Christmas Present's spiritual connection to the event\n\nChristmas Present smiles and blesses Bob Cratchit's dwelling, which indicates a profound spiritual connection to the event. This relationship underscores the significance of the celebration and the entities involved. [Data: Relationships (15, 169)]\n\n## The significance of the Christmas celebration\n\nThe Christmas celebration at Bob Cratchit's dwelling is a key event in the community, representing joy and unity. The presence of Christmas Present and the blessing of the dwelling emphasize the importance of this event in the community's structure. [Data: Entities (127), Relationships (15, 169)]\n\n## Bob Cratchit's role in the community\n\nBob Cratchit is implicitly a central figure in the community, as his dwelling is the location of the Christmas celebration. The relationship between Bob Cratchit and Christmas Present suggests a pivotal role in the event and the community's dynamics. [Data: Relationships (15)]\n\n## The community's focus on traditional values\n\nThe entities and their relationships in this community reflect a focus on traditional values and the importance of community and family during the Christmas season. This traditional aspect minimizes potential conflict or negative impact within the community. [Data: Entities (123, 127), Relationships (15, 169)]",
            "# The Christmas Spirits and Ebenezer Scrooge\n\nThis community is centered around Ebenezer Scrooge and his transformative journey guided by the three ghosts of Christmas. The entities include the spirits of Christmas Past, Present, and Yet to Come, Scrooge himself, and various characters from his life. The relationships and interactions among these entities reveal the narrative of Scrooge's redemption.\n\n## The central role of Ebenezer Scrooge\n\nEbenezer Scrooge is the central figure in this community, with relationships to all three ghosts and several other characters. His transformation from a miser to a more generous and empathetic person is the focal point of the story. Scrooge's interactions with the ghosts and other characters highlight his journey and the changes he undergoes [Data: Entities (13); Relationships (30, 28, 34, 8, 36, 22, 29, 27, 33, 38, 37, 20, 21, 35)].\n\n## The ghosts' influence on Scrooge\n\nThe ghosts of Christmas Past, Present, and Yet to Come play a pivotal role in Scrooge's transformation. Each spirit provides Scrooge with insights into his past, present, and future, guiding him towards a change in behavior and attitude. Their visits are powerful and transformative moments in the story [Data: Entities (10, 9, 11); Relationships (30, 28, 34)].\n\n## Scrooge's strained relationships\n\nScrooge's relationships with his nephew Fred and his employee Bob Cratchit are strained. These relationships highlight Scrooge's initial lack of empathy and his transformation towards the end of the story. The interactions with these characters serve as a stark contrast to the warmth and generosity that the ghosts represent [Data: Relationships (36, 22, 8, 20)].\n\n## The significance of the Christmas setting\n\nChristmas serves as the backdrop for Scrooge's transformation. The holiday's associated festivities, such as the march of the ghosts and the preparations by the bakers, underscore the contrast between Scrooge's coldness and the warmth of the holiday spirit. The setting is integral to the narrative and Scrooge's change of heart [Data: Relationships (31, 32)].\n\n## The role of symbols in the community\n\nSymbols such as the candles and fog play a metaphorical role in the story, representing the contrast between light and darkness, warmth and coldness, and clarity and obscurity. These symbols reflect Scrooge's character and his journey towards enlightenment [Data: Relationships (38, 37)].\n\n## The transformative power of the supernatural\n\nThe supernatural elements of the story, specifically the ghosts, are instrumental in Scrooge's transformation. Their ability to transcend time and reveal the consequences of actions underscore the transformative power of the supernatural in this community [Data: Entities (10, 9, 11); Relationships (30, 28, 34)].\n\n## The impact of Scrooge's transformation\n\nScrooge's transformation has a significant impact on his community. His change in behavior influences his relationships with family, employees, and others, potentially leading to a more joyful and empathetic community atmosphere. The story emphasizes the ripple effect of individual change on the broader community [Data: Relationships (8, 20, 36, 22)].",
            "# Scrooge's Market-Town Memories\n\nThe community is centered around Scrooge's memories of a market-town, which includes specific landmarks such as a bridge, a church, and a river. The entities and their relationships reveal a nostalgic connection to Scrooge's past.\n\n## Scrooge's personal connection to the market-town\n\nScrooge has a strong personal connection to the market-town from his youth, remembering every detail with clarity. This suggests that the market-town holds significant emotional value to Scrooge. [Data: Relationships (67)]\n\n## The market-town's landmarks and their significance\n\nThe market-town contains specific landmarks that are part of Scrooge's past memories, including a bridge, a church, and a river. These landmarks contribute to the vividness of Scrooge's memories and may represent important aspects of his past experiences. [Data: Relationships (135, 136, 137)]\n\n## The bridge as a memorable feature\n\nThe bridge within the market-town is a memorable feature from Scrooge's past. Its inclusion in Scrooge's memories indicates that it may have been a significant or frequently visited spot. [Data: Relationships (135)]\n\n## The church's role in Scrooge's history\n\nThe church is another landmark that plays a role in Scrooge's historical memories. It may represent a place of sanctuary or community in Scrooge's past. [Data: Relationships (136)]\n\n## The river's presence in Scrooge's memories\n\nThe presence of a winding river in Scrooge's memories suggests that natural elements and topography were influential in shaping his experiences in the market-town. [Data: Relationships (137)]\n\n## The market-town's overall impact on Scrooge's development\n\nThe market-town's various elements, including the bridge, church, and river, collectively contributed to Scrooge's personal development and shaped his perception of the world. The degree of detail Scrooge remembers indicates a profound impact on his life. [Data: Entities (61), Relationships (67, 135, 136, 137)]",
            "# The Gathered Family and the Man's Death\n\nThis community is centered around a family gathering during Christmas, where the mood is affected by the news of a man's death. The entities within this community are primarily characterized by their relationships to the event and to each other, with the man's death serving as a pivotal point that influences the atmosphere and interactions among the characters.\n\n## The children as a central focus of the gathering\n\nThe children are a lively group that is central to the family gathering. Their actions and interactions with other characters are pivotal to the scene. Their happiness and excitement are, however, marred by the news of the man's death [Data: Entities (105), Relationships (90, 157, 158, 159)].\n\n## The emotional impact of the man's death on the gathering\n\nThe man's death has a significant emotional impact on the gathering, influencing the mood and interactions of the family members. This event is a central theme that weaves through the relationships and dynamics of the community [Data: Entities (180), Relationships (161, 196, 197)].\n\n## Scrooge's reflection on the man's death and its implications\n\nScrooge is seen reflecting on the man's death and its implications, suggesting a deeper connection or a moral lesson that the story aims to convey. This reflection adds a layer of complexity to the community's dynamics [Data: Relationships (99)].\n\n## The family gathering as a Christmas event\n\nThe family gathering is a Christmas event, which adds a layer of traditional significance to the community. The celebration is disrupted by the news of the man's death, creating a contrast between joy and sorrow [Data: Relationships (112)].\n\n## The role of the comely matron and her daughter in the community\n\nThe comely matron and her daughter play a role in the interactions with the children, suggesting a generational bond and continuity within the family. The comely matron is also a representation of the young girl from Scrooge's past, highlighting the theme of growth and change within the community [Data: Entities (102, 103, 104), Relationships (155, 156)].\n\n## The husband's role in delivering the news of the man's death\n\nThe husband's role is significant as he is the one who brings the news of the man's death to the mother, thus directly impacting the emotional state of the family gathering. His actions serve as a catalyst for the emotional reactions of the other characters [Data: Entities (182), Relationships (198)].\n\n## The mother's anxious wait and her reaction to the news\n\nThe mother is depicted as anxiously waiting for her husband, and her reaction to the news of the man's death is a pivotal moment in the community's dynamics. Her emotional state is emblematic of the impact that the news has on the family gathering [Data: Entities (181), Relationships (198)].\n\n## The emotional impact of the man's death on the town\n\nThe man's death is not only significant to the family but also has an emotional impact on the broader community of the town. This suggests that the event has far-reaching consequences beyond the immediate family circle [Data: Entities (183), Relationships (197)].",
            "# Scrooge's Counting-House Climate\n\nThe community is centered around the working conditions within Scrooge's counting-house, with the CLERK being significantly affected by Scrooge's miserliness. The entities and their relationships reveal a situation where the lack of warmth and holiday consideration could impact employee morale and well-being.\n\n## Scrooge's direct influence on the working environment\n\nScrooge's control over the coal-box and the clerk's working conditions is a central issue in this community. The clerk's cold working environment is a direct result of Scrooge's miserliness, which affects the employee's ability to stay warm. This condition is indicative of Scrooge's approach to managing his counting-house. [Data: Relationships (47, 116)]\n\n## The clerk's struggle with cold working conditions\n\nThe clerk is forced to work in a small, dimly lit cell within Scrooge's counting-house, which is poorly heated. The use of a white comforter by the clerk signifies a desperate attempt to keep warm, highlighting the inadequate conditions of the workplace. [Data: Entities (22, 28); Relationships (114, 117)]\n\n## Discussion of Christmas Day off\n\nThe clerk's desire to take Christmas Day off is an aspect of the community that reflects on the employee's need for a holiday break. This discussion indicates the clerk's dissatisfaction with the current working conditions and the lack of holiday consideration. [Data: Relationships (109)]\n\n## The counting-house as the core of the community\n\nThe counting-house is the central location where the entities interact, and it sets the tone for the working conditions within the community. The environment of the counting-house, influenced by Scrooge's attitude, shapes the experiences of the clerk and is central to understanding the dynamics of this community. [Data: Relationships (114)]\n\n## The coal-box as a symbol of Scrooge's control\n\nThe coal-box, which the clerk cannot access, symbolizes Scrooge's control and miserliness. It is a physical representation of the power dynamics within the community, where Scrooge's actions directly impact the clerk's quality of life at work. [Data: Entities (27); Relationships (116)]",
            "# Scrooge's Christmas Community\n\nThe community is centered around Scrooge and his family, particularly his nephew Fred and niece, with the Christmas celebration at Fred's house as the pivotal event. The relationships between family members and their interactions during the Christmas party provide insights into the dynamics of this community.\n\n## Fred as the central figure organizing the Christmas celebration\n\nFred, Scrooge's nephew, is the central figure in organizing the Christmas celebration. He extends an invitation to Scrooge and is connected to other characters through social bonds. Fred's role in the community is significant as he bridges the gap between Scrooge and the rest of the family. [Data: Entities (8), Relationships (23, 24, 25, 26)]\n\n## Strained relationship between Scrooge and his family\n\nScrooge maintains a strained relationship with both his nephew and niece. Despite the tension, the family dynamics are crucial to understanding the community's structure, as the Christmas celebration brings them together, showcasing the complexity of their relationships. [Data: Relationships (22, 48, 92)]\n\n## The Christmas celebration as a unifying event\n\nThe Christmas celebration at Fred's house is a unifying event that connects all the characters in the community. It serves as a backdrop for various interactions and relationships, highlighting the importance of tradition and family in this community. [Data: Relationships (24)]\n\n## Social interactions and bonds within the community\n\nThe community is characterized by social interactions and bonds, such as those between Fred and Topper, the plump sister, and Scrooge's niece's sisters. These interactions indicate a close-knit group of characters that engage in festive activities and conversations. [Data: Relationships (25, 26, 118, 119, 185, 184)]\n\n## Scrooge's niece and her influence on the community\n\nScrooge's niece is an influential figure within the community due to her strained relationship with Scrooge and her musical talent. Her presence adds a layer of complexity to the family dynamics and the Christmas celebration. [Data: Entities (155), Relationships (92, 183)]",
            "# The Christmas Spirits and Scrooge's Redemption\n\nThis community is centered around the interactions of Scrooge with supernatural entities, primarily the GHOST and JACOB MARLEY, who guide Scrooge through visions to learn the error of his ways. The entities associated with this community play significant roles in a Christmas-themed narrative intended to lead Scrooge to redemption.\n\n## Scrooge's direct interaction with the GHOST\n\nScrooge, the main character in this narrative, is directly haunted by the GHOST, which is the manifestation of the spirit of Jacob Marley. This interaction is central to the community's structure, as it sets the stage for Scrooge's transformation. The GHOST serves as a guide, leading Scrooge through a series of visions to help him understand the consequences of his actions [Data: Relationships (61)]\n\n## Jacob Marley's spectral intervention\n\nJacob Marley, a deceased business partner of Scrooge, appears as a ghost to Scrooge, serving as a harbinger of the moral lessons Scrooge is about to learn. Marley's spectral form acts as a conduit for Scrooge's redemption, highlighting the profound connection between the two spirits and their shared past [Data: Relationships (62, 127); Entities (53)]\n\n## The Christmas association with the supernatural entities\n\nThe ghosts visiting Scrooge are associated with Christmas, which is a significant aspect of this community. The timing and context of the supernatural interventions are linked to the holiday season, adding a layer of thematic importance to the narrative [Data: Relationships (110)]\n\n## The GHOST's role in Scrooge's moral transformation\n\nThe GHOST plays a pivotal role in Scrooge's moral transformation by providing a vision of Tiny Tim's potential fate. This vision is a turning point for Scrooge, compelling him to change his ways and become a more compassionate individual [Data: Relationships (128)]\n\n## Scrooge's past and future revealed through visions\n\nAs part of Scrooge's redemption, the GHOST reveals scenes from Scrooge's past and potential future. These visions are crucial in illustrating the impact of Scrooge's actions and serve as a catalyst for his transformation [Data: Entities (54)]\n\n## The supernatural journey includes physical locations\n\nDuring Scrooge's supernatural journey, he and the GHOST visit physical locations such as a lighthouse and a moor. These visits are symbolic and serve to enhance the narrative's themes of guidance and reflection [Data: Relationships (130, 129)]\n\n## The counting-house as a backdrop to Marley's connection\n\nThe counting-house is mentioned in relation to Jacob Marley, indicating a shared professional history with Scrooge. This detail underscores the depth of Marley's connection to Scrooge and the relevance of their past business relationship to the narrative [Data: Relationships (115)]\n\n## Holiday cheer contrasted with the supernatural elements\n\nIn contrast to the eerie supernatural elements, there is a moment of holiday cheer depicted at the lighthouse with two men sharing a Merry Christmas wish. This contrast serves to highlight the juxtaposition between the darkness of Scrooge's past and the potential for redemption and joy in his future [Data: Relationships (179); Entities (144, 145)]"
        ]
    }
}
{
    "type": "error",
    "data": "Error executing verb \"generate_text_embeddings\" in generate_text_embeddings: Error code: 400 - {'error': {'code': '1210', 'message': 'API 调用参数有误，请检查文档。'}}",
    "stack": "Traceback (most recent call last):\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\datashaper\\workflow\\workflow.py\", line 415, in _execute_verb\n    result = await result\n             ^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\workflows\\v1\\subflows\\generate_text_embeddings.py\", line 56, in generate_text_embeddings\n    await generate_text_embeddings_flow(\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\flows\\generate_text_embeddings.py\", line 106, in generate_text_embeddings\n    await _run_and_snapshot_embeddings(\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\flows\\generate_text_embeddings.py\", line 129, in _run_and_snapshot_embeddings\n    data[\"embedding\"] = await embed_text(\n                        ^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\operations\\embed_text\\embed_text.py\", line 92, in embed_text\n    return await _text_embed_with_vector_store(\n           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\operations\\embed_text\\embed_text.py\", line 182, in _text_embed_with_vector_store\n    result = await strategy_exec(\n             ^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\operations\\embed_text\\strategies\\openai.py\", line 62, in run\n    embeddings = await _execute(llm, text_batches, ticker, semaphore)\n                 ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\operations\\embed_text\\strategies\\openai.py\", line 106, in _execute\n    results = await asyncio.gather(*futures)\n              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\operations\\embed_text\\strategies\\openai.py\", line 100, in embed\n    chunk_embeddings = await llm(chunk)\n                       ^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\caching_llm.py\", line 96, in __call__\n    result = await self._delegate(input, **kwargs)\n             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\rate_limiting_llm.py\", line 177, in __call__\n    result, start = await execute_with_retry()\n                    ^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\rate_limiting_llm.py\", line 159, in execute_with_retry\n    async for attempt in retryer:\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\tenacity\\asyncio\\__init__.py\", line 166, in __anext__\n    do = await self.iter(retry_state=self._retry_state)\n         ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\tenacity\\asyncio\\__init__.py\", line 153, in iter\n    result = await action(retry_state)\n             ^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\tenacity\\_utils.py\", line 99, in inner\n    return call(*args, **kwargs)\n           ^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\tenacity\\__init__.py\", line 398, in <lambda>\n    self._add_action_func(lambda rs: rs.outcome.result())\n                                     ^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\concurrent\\futures\\_base.py\", line 449, in result\n    return self.__get_result()\n           ^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\concurrent\\futures\\_base.py\", line 401, in __get_result\n    raise self._exception\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\rate_limiting_llm.py\", line 165, in execute_with_retry\n    return await do_attempt(), start\n           ^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\rate_limiting_llm.py\", line 147, in do_attempt\n    return await self._delegate(input, **kwargs)\n           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\base_llm.py\", line 50, in __call__\n    return await self._invoke(input, **kwargs)\n           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\base_llm.py\", line 54, in _invoke\n    output = await self._execute_llm(input, **kwargs)\n             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\openai\\openai_embeddings_llm.py\", line 36, in _execute_llm\n    embedding = await self.client.embeddings.create(\n                ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\resources\\embeddings.py\", line 236, in create\n    return await self._post(\n           ^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\_base_client.py\", line 1843, in post\n    return await self.request(cast_to, opts, stream=stream, stream_cls=stream_cls)\n           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\_base_client.py\", line 1537, in request\n    return await self._request(\n           ^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\_base_client.py\", line 1638, in _request\n    raise self._make_status_error_from_response(err.response) from None\nopenai.BadRequestError: Error code: 400 - {'error': {'code': '1210', 'message': 'API 调用参数有误，请检查文档。'}}\n",
    "source": "Error code: 400 - {'error': {'code': '1210', 'message': 'API 调用参数有误，请检查文档。'}}",
    "details": null
}
{
    "type": "error",
    "data": "Error running pipeline!",
    "stack": "Traceback (most recent call last):\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\run\\run.py\", line 269, in run_pipeline\n    result = await _process_workflow(\n             ^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\run\\workflow.py\", line 105, in _process_workflow\n    result = await workflow.run(context, callbacks)\n             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\datashaper\\workflow\\workflow.py\", line 369, in run\n    timing = await self._execute_verb(node, context, callbacks)\n             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\datashaper\\workflow\\workflow.py\", line 415, in _execute_verb\n    result = await result\n             ^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\workflows\\v1\\subflows\\generate_text_embeddings.py\", line 56, in generate_text_embeddings\n    await generate_text_embeddings_flow(\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\flows\\generate_text_embeddings.py\", line 106, in generate_text_embeddings\n    await _run_and_snapshot_embeddings(\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\flows\\generate_text_embeddings.py\", line 129, in _run_and_snapshot_embeddings\n    data[\"embedding\"] = await embed_text(\n                        ^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\operations\\embed_text\\embed_text.py\", line 92, in embed_text\n    return await _text_embed_with_vector_store(\n           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\operations\\embed_text\\embed_text.py\", line 182, in _text_embed_with_vector_store\n    result = await strategy_exec(\n             ^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\operations\\embed_text\\strategies\\openai.py\", line 62, in run\n    embeddings = await _execute(llm, text_batches, ticker, semaphore)\n                 ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\operations\\embed_text\\strategies\\openai.py\", line 106, in _execute\n    results = await asyncio.gather(*futures)\n              ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\index\\operations\\embed_text\\strategies\\openai.py\", line 100, in embed\n    chunk_embeddings = await llm(chunk)\n                       ^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\caching_llm.py\", line 96, in __call__\n    result = await self._delegate(input, **kwargs)\n             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\rate_limiting_llm.py\", line 177, in __call__\n    result, start = await execute_with_retry()\n                    ^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\rate_limiting_llm.py\", line 159, in execute_with_retry\n    async for attempt in retryer:\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\tenacity\\asyncio\\__init__.py\", line 166, in __anext__\n    do = await self.iter(retry_state=self._retry_state)\n         ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\tenacity\\asyncio\\__init__.py\", line 153, in iter\n    result = await action(retry_state)\n             ^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\tenacity\\_utils.py\", line 99, in inner\n    return call(*args, **kwargs)\n           ^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\tenacity\\__init__.py\", line 398, in <lambda>\n    self._add_action_func(lambda rs: rs.outcome.result())\n                                     ^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\concurrent\\futures\\_base.py\", line 449, in result\n    return self.__get_result()\n           ^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\concurrent\\futures\\_base.py\", line 401, in __get_result\n    raise self._exception\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\rate_limiting_llm.py\", line 165, in execute_with_retry\n    return await do_attempt(), start\n           ^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\rate_limiting_llm.py\", line 147, in do_attempt\n    return await self._delegate(input, **kwargs)\n           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\base_llm.py\", line 50, in __call__\n    return await self._invoke(input, **kwargs)\n           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\base\\base_llm.py\", line 54, in _invoke\n    output = await self._execute_llm(input, **kwargs)\n             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\graphrag\\llm\\openai\\openai_embeddings_llm.py\", line 36, in _execute_llm\n    embedding = await self.client.embeddings.create(\n                ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\resources\\embeddings.py\", line 236, in create\n    return await self._post(\n           ^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\_base_client.py\", line 1843, in post\n    return await self.request(cast_to, opts, stream=stream, stream_cls=stream_cls)\n           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\_base_client.py\", line 1537, in request\n    return await self._request(\n           ^^^^^^^^^^^^^^^^^^^^\n  File \"C:\\Users\\Administrator\\anaconda3\\envs\\graph\\Lib\\site-packages\\openai\\_base_client.py\", line 1638, in _request\n    raise self._make_status_error_from_response(err.response) from None\nopenai.BadRequestError: Error code: 400 - {'error': {'code': '1210', 'message': 'API 调用参数有误，请检查文档。'}}\n",
    "source": "Error code: 400 - {'error': {'code': '1210', 'message': 'API 调用参数有误，请检查文档。'}}",
    "details": null
}
